[
    { 
        "title": "Building A Second Brain With Notion: Storing Everything You Know In One Place", 
        "date": "12 Feb 2021", 
        "link": "/blog/buildingASecondBrainWithNotion", 
        "tags": "Organisation", 
        "description": "A Second Brain is simply just a single place where you store the things you know and learn. Whatever you store depends entirely on you and is based on what things add value to your life. Before, I was mostly relying on my brain to remember everything I knew or any new information I had learnt. If I did need to write things down, I would store information in many different places..."
    },
    { 
        "title": "Hosting A Hugo Application Using Github and Netlify", 
        "date": "4 Jan 2021", 
        "link": "/blog/hostingAHugoAppUsingGithubAndNetlify", 
        "tags": "Hugo • Netlify", 
        "description": "Netlify is a free hosting platform where you can host your website live for free. One way it can do this is by linking to an existing Github repository and hosting your code stored there. If you have a Hugo App stored on a repository, you can use Netlify to host it. All you have to do is buy your own custom domain name and link it to Netlify..."
    },
    { 
        "title": "Linking A Namecheap Domain To Firebase",  
        "date": "4 Oct 2020", 
        "link": "/blog/linkingANamecheapDomainToFirebase", 
        "tags": "Hosting • Firebase • Namecheap", 
        "description": "Assuming you already have a website hosted on Firebase, you might not be satisfied with the default free domain name (which ends in something like .firebaseapp.com or .web.app). If you've already bought a Namecheap domain name, this is how you can link it to your Firebase hosted website..."
    },
    { 
        "title": "Hosting An Angular Application Using Github And Netlify", 
        "date": "30 Aug 2020", 
        "link": "/blog/hostingAngularApplicationUsingGithubAndNetlify", 
        "tags": "Angular • Github • Netlify", 
        "description": "Hugo is a framework where you can create your own website, completely from scratch without much effort or without knowing too much (or any) of the internal programming. There are also many web hosting platforms that can easily host a Hugo project for free - meaning, the only money you will spend will be for the custom domain name..."
    },
    { 
        "title": "Setting Up A Github Repository and Creating A Local Copy", 
        "date": "22 Aug 2020", 
        "link": "/blog/settingUpAGithubRepositoryAndCreatingALocalCopy", 
        "tags": "Version Control • Github", 
        "description": "GitHub is a free version control platform where you can store your code online in repositories. When we create a Github repository, we are creating a place online where we can store our code files for a project remotely. This is a simple tutorial that will help you quickly set up an online remote repository on Github, which will be linked to a local folder on your computer..."
    },
    { 
        "title": "Upload An Image To Instagram Using A Desktop Computer", 
        "date": "11 Aug 2020", 
        "link": "/blog/uploadAnImageToInstagramUsingADesktopComputer", 
        "tags": "Design • Social Media", 
        "description": "Sometimes you need to upload photos to Instagram on a computer, especially if you are using a computer to edit photos or create vector art. It can be really annoying to keep transferring them onto your phone and uploading it from there (and if you can't airdrop it using an IPhone, the quality of these photos can be reduced)..."
    }
]

