[
  { 
      "title": "Hosting an Angular Application using Github and Netlify", 
      "date": "30 Aug 2020", 
      "link": "/blog/hostingAngularApplicationUsingGithubAndNetlify", 
      "tags": "Angular • Netlify • Hosting", 
      "description": "Netlify is a free hosting platform where you can host your website live using a customisable domain name provided with a .netlify.app extension at the end (you can also link your own custom domain if you'd like). One way Netlify does this is by connecting to an existing repository and hosting your website code stored there. In this tutorial we will go through how to host an Angular web application using Netlify in 4 steps..."
  },
  { 
      "title": "Setting Up A Github Repository and Creating A Local Copy", 
      "date": "22 Aug 2020", 
      "link": "/blog/settingUpAGithubRepositoryAndCreatingALocalCopy", 
      "tags": "Version Control • Github", 
      "description": "GitHub is a free version control platform where you can store your code online in repositories. When we create a Github repository, we are creating a place online where we can store our code files for a project remotely. This is a simple tutorial that will help you quickly set up an online remote repository on Github, which will be linked to a local folder on your computer..."
  },
  { 
      "title": "Upload An Image To Instagram Using A Desktop Computer", 
      "date": "11 Aug 2020", 
      "link": "/blog/uploadAnImageToInstagramUsingADesktopComputer", 
      "tags": "Design • Social Media", 
      "description": "Sometimes you need to upload photos to Instagram on a computer, especially if you are using a computer to edit photos or create vector art. It can be really annoying to keep transferring them onto your phone and uploading it from there (and if you can't airdrop it using an IPhone, the quality of these photos can be reduced)..."
  },
  { 
      "title": "Creating A Simple Angular Web Application", 
      "date": "04 Aug 2020", 
      "link": "/blog/creatingASimpleAngularWebApplication", 
      "tags": "Angular", 
      "description": "This tutorial will go through how you can create a simple angular web app in 3 stages: Setting up the environment, adding pages to the app, and adding the navbar and configuring routes..."
  },
  { 
      "title": "How To Organise Your Web Browsing", 
      "date": "25 May 2020", 
      "link": "/blog/howToOrganiseYourWebBrowsing", 
      "tags": "Organisation", 
      "description": "These days, many people spend most of their time surfing the web or conducting important business online. It makes sense to have your accounts, passwords, general online activities and frequently used websites organised in order to make things easier to access. Other online tools can also be utilised to increase productivity by managing social media posts and tracking the time you spend on time wasting websites..."
  },
  { 
      "title": "Organising Your Computer To Increase Productivity", 
      "date": "16 May 2020", 
      "link": "/blog/organisingYourComputerToIncreaseProductivity", 
      "tags": "Organisation", 
      "description": "Having a well organised computer can improve your overall workflow and efficiency. Having too many folders and files in different places can make it difficult to find what you are looking for. Here are a few suggestions on how you can better organise your computer, including your files, applications and overall layout..."
  }
]

